;; -*- no-byte-compile: t; -*-
;;; ui/dired/packages.el


(package! dirvish)
(package! diredfl)
(package! all-the-icons-dired)
(package! dired-hide-dotfiles)
(package! dired-subtree)
(package! dired-ranger)
(package! dired-quick-sort)
(package! async)
